#ifndef __DEFINES_H__
#define __DEFINES_H__

/////////////////////////////////////////////////////////////////
// ЗДЕСЬ СОБРАНЫ ПОЛЬЗОВАТЕЛЬСКИЕ НАСТРОЙКИ//////////////////////
/////////////////////////////////////////////////////////////////
/////////////////////////////////////
// Акселерометер
/////////////////////////////////////
// количество чтений при оценке силы удара
#define ACCUM_SAMPLES_COUNT         210
// количество чтений при переходе в режим готовности
#define STILL_SAMPLES_COUNT         450
// пороговое значение акселерометра при переходе в режим оценки удара
#define ACCEL_START_THRESH          500  // общий вектор сложения ускорений
#define ACCEL_AXIS_THRESH           4000  // перегрузки, разложенные по осям
/////////////// Сила на экран  ПРИ-ВОДКА К 999 //////////////////////////
// Диапазон с датчика Акселя (до приведения к 10..999) ,g*2048 едениц
#define HI_PUNCH     15000    // 40g максимальная ускорение в голову (до приведения к 10..999)  было 81920
#define LOW_PUNCH     500    // минимальное ускорение

//#define NLOG
//#define NDEBUG

#endif
